[
    {
      "article_link": "https://ieeexplore.ieee.org/document/9652153",
      "title": "Question Answering Model Based Conversational Chatbot using BERT Model and Google Dialogflow",
      "description": "This paper presents a Question Answering Model (QAM) that integrates BERT and Google Dialogflow to enhance conversational chatbot performance by enabling it to answer reading comprehension questions using large datasets.",
      "topic": "Artificial Intelligence",
      "source_type": "Conference Paper",
      "credibility": "High",
      "region": "Global",
      "published_date": "2021-11-24",
      "created_at": "2025-05-10",
      "author": "Nikita Kanodia, Khandakar Ahmed, Yuan Miao"
    },
    {
      "article_link": "https://ieeexplore.ieee.org/document/9652129",
      "title": "NIDP: Low-Latency Networking without Application Customization in Virtual Machine",
      "description": "This paper introduces NIDP, a low-latency, high-throughput networking solution for virtual machines that requires no application customization or Linux kernel modification, improving performance for real-time applications such as online games and autonomous vehicles.",
      "topic": "Networking",
      "source_type": "Conference Paper",
      "credibility": "High",
      "region": "Global",
      "published_date": "2021-11-24",
      "created_at": "2025-05-10",
      "author": "Kei Fujimoto, Ko Natori, Masashi Kaneko, Akinori Shiraga"
    },
    {
        "article_link": "https://ieeexplore.ieee.org/document/9652135",
        "title": "A Comparative Performance Analysis of MPTCP Path Management Algorithms: Fullmesh, PCDC, RBPM, SDC",
        "description": "This paper compares and analyzes the performance of four MPTCP path management algorithms—Fullmesh, PCDC, RBPM, and SDC—based on throughput, small data stream completion time, and algorithm complexity using the NorNet testbed.",
        "topic": "Computer Networks",
        "source_type": "Conference Paper",
        "credibility": "High",
        "region": "Global",
        "published_date": "2021-11-27",
        "created_at": "2025-05-10",
        "author": "Huayi Xiong, Yantao Cai, Min Chen, Xing Zhou"
      },
      {
        "article_link": "https://doi.org/10.1145/3593042",
        "title": "A Survey of Adversarial Defenses and Robustness in NLP",
        "description": "This survey reviews various adversarial defense mechanisms proposed for natural language processing tasks, highlighting both their effectiveness and the persistent vulnerability of deep neural networks to adversarial perturbations.",
        "topic": "Natural Language Processing",
        "source_type": "Journal Article",
        "credibility": "High",
        "region": "Global",
        "published_date": "2023-07-17",
        "created_at": "2025-05-10",
        "author": "Shreya Goyal, Sumanth Doddapaneni, Mitesh M. Khapra, Balaraman Ravindran"
      },
      {
        "article_link": "https://doi.org/10.48550/arXiv.2505.05440",
        "title": "EcoAgent: An Efficient Edge-Cloud Collaborative Multi-Agent Framework for Mobile Automation",
        "description": "This paper proposes EcoAgent, an edge-cloud collaborative multi-agent framework designed to enhance mobile automation. It optimizes task success rates while reducing multimodal large language model token consumption in mobile tasks.",
        "topic": "Artificial Intelligence",
        "source_type": "Preprint",
        "credibility": "Moderate",
        "region": "Global",
        "published_date": "2025-05-08",
        "created_at": "2025-05-10",
        "author": "Biao Yi, Xavier Hu, Yurun Chen, Shengyu Zhang, Hongxia Yang, Fan Wu, Fei Wu"
      },
      {
        "article_link": "https://doi.org/10.48550/arXiv.2505.05235",
        "title": "Advancing Neural Network Verification through Hierarchical Safety Abstract Interpretation",
        "description": "This paper introduces Abstract DNN-Verification, a method for verifying the safety of deep neural networks using hierarchical safety levels, offering more granular and computationally efficient verification compared to traditional binary methods.",
        "topic": "Artificial Intelligence",
        "source_type": "Preprint",
        "credibility": "Moderate",
        "region": "Global",
        "published_date": "2025-05-08",
        "created_at": "2025-05-10",
        "author": "Luca Marzari, Isabella Mastroeni, Alessandro Farinelli"
      },
      {
        "article_link": "https://doi.org/10.48550/arXiv.2505.04997",
        "title": "Foam-Agent: Towards Automated Intelligent CFD Workflows",
        "description": "Foam-Agent is a multi-agent framework that automates complex OpenFOAM-based CFD simulations from natural language inputs, significantly improving task success rates and lowering the expertise threshold for users in computational fluid dynamics.",
        "topic": "Artificial Intelligence",
        "source_type": "Preprint",
        "credibility": "Moderate",
        "region": "Global",
        "published_date": "2025-05-08",
        "created_at": "2025-05-10",
        "author": "Ling Yue, Nithin Somasekharan, Yadi Cao, Shaowu Pan"
      },
      {
        "article_link": "https://doi.org/10.48550/arXiv.2302.00048",
        "title": "Multilinear Oscillatory Integrals and Estimates for Coupled Systems of Dispersive PDEs",
        "description": "This paper establishes sharp global regularity for a class of multilinear oscillatory integral operators related to nonlinear dispersive equations, proving continuous dependence on initial data for solutions to coupled systems of dispersive partial differential equations.",
        "topic": "Mathematics",
        "source_type": "Preprint",
        "credibility": "Moderate",
        "region": "Global",
        "published_date": "2023-01-31",
        "created_at": "2025-05-10",
        "author": "Aksel Bergfeldt, Salvador Rodriguez-Lopez, David Rule, Wolfgang Staubach"
      },
      {
        "article_link": "https://doi.org/10.48550/arXiv.2302.00080",
        "title": "Rainbow Hamilton Cycle in Hypergraph System",
        "description": "This paper develops a new framework for rainbow Hamilton cycles, proving the existence of a tight Hamilton cycle in a k-graph system under specific conditions, settling a problem for k=3 and generalizing for any k ≥ 3.",
        "topic": "Mathematics",
        "source_type": "Preprint",
        "credibility": "Moderate",
        "region": "Global",
        "published_date": "2023-01-31",
        "created_at": "2025-05-10",
        "author": "Yucong Tang, Bin Wang, Guanghui Wang, Guiying Yan"
      },
      {
        "article_link": "https://doi.org/10.48550/arXiv.2302.00121",
        "title": "Homogeneous Multigrid Method for HDG Applied to the Stokes Equation",
        "description": "This paper proposes a multigrid method for solving linear systems arising from hybrid discontinuous Galerkin discretizations of the Stokes problem, proving uniform convergence through the augmented Lagrangian approach.",
        "topic": "Mathematics",
        "source_type": "Preprint",
        "credibility": "Moderate",
        "region": "Global",
        "published_date": "2023-01-31",
        "created_at": "2025-05-10",
        "author": "Peipei Lu, Wei Wang, Guido Kanschat, Andreas Rupp"
      },
      {
        "article_link": "https://doi.org/10.48550/arXiv.2304.00081",
        "title": "Reconstructing Firm-Level Input-Output Networks from Partial Information",
        "description": "This paper presents a maximum entropy method for reconstructing firm-level input-output networks from incomplete data, demonstrating its application to datasets of Ecuador and globally listed firms, and discussing its performance in various economic metrics.",
        "topic": "Economics",
        "source_type": "Preprint",
        "credibility": "Moderate",
        "region": "Global",
        "published_date": "2023-03-31",
        "created_at": "2025-05-10",
        "author": "Andrea Bacilieri, Pablo Austudillo-Estevez"
      },
      {
        "article_link": "https://doi.org/10.48550/arXiv.2304.00539",
        "title": "The Short- and Long-Term Determinants of Fertility in Uruguay",
        "description": "This paper analyzes the determinants of fertility in Uruguay, finding relationships between fertility and economic factors, education, and infant mortality, with significant differences observed by reproductive stage and age group of women.",
        "topic": "Economics",
        "source_type": "Preprint",
        "credibility": "Moderate",
        "region": "Uruguay",
        "published_date": "2023-04-02",
        "created_at": "2025-05-10",
        "author": "Zuleika Ferre, Patricia Triunfo, José-Ignacio Antón"
      },
      {
        "article_link": "https://doi.org/10.48550/arXiv.2407.01364",
        "title": "Co-benefits of Agricultural Diversification and Technology for Food and Nutrition Security in China",
        "description": "The paper examines the potential co-benefits of agricultural diversification and technological innovations in enhancing China's food and nutrition security, focusing on ecosystem services, yield resilience, and the link between agriculture and public health.",
        "topic": "Economics",
        "source_type": "Preprint",
        "credibility": "Moderate",
        "region": "China",
        "published_date": "2024-07-01",
        "created_at": "2025-05-10",
        "author": "Thomas Cherico Wanger, Estelle Raveloaritiana, Siyan Zeng, Haixiu Gao, Xueqing He, Yiwen Shao, Panlong Wu, Kris A.G. Wyckhuys, Wenwu Zhou, Yi Zou, Zengrong Zhu, Ling Li, Haiyan Cen, Yunhui Liu, Shenggen Fan"
      },
      {
        "article_link": "https://doi.org/10.48550/arXiv.2407.01555",
        "title": "Unveiling Patterns in European Airbnb Prices: A Comprehensive Analytical Study Using Machine Learning Techniques",
        "description": "This study investigates the pricing dynamics of Airbnb in major European cities, using machine learning models to analyze factors like location, property types, and host-related characteristics. It aims to offer insights for hosts and travelers to better understand pricing strategies.",
        "topic": "Economics",
        "source_type": "Preprint",
        "credibility": "Moderate",
        "region": "Europe",
        "published_date": "2024-04-30",
        "created_at": "2025-05-10",
        "author": "Trinath Sai Subhash Reddy Pittala, Uma Maheswara R Meleti, Hemanth Vasireddy"
      },
      {
        "article_link": "https://doi.org/10.48550/arXiv.2305.00049",
        "title": "Twistorial monopoles & chiral algebras",
        "description": "This paper explores the impact of magnetically charged states in 4d self-dual gauge theories on 2d chiral algebras, using the 4d/2d twistorial correspondence. It introduces non-perturbative enhancements of the celestial chiral algebra and explores the connection between 4d monopoles and spectral flow automorphisms.",
        "topic": "High Energy Physics - Theory",
        "source_type": "Preprint",
        "credibility": "High",
        "region": "International",
        "published_date": "2023-07-06",
        "created_at": "2025-05-10",
        "author": "Niklas Garner, Natalie M. Paquette"
      },
      {
        "article_link": "https://doi.org/10.48550/arXiv.2407.00180",
        "title": "Super-Eddington Magnetized Neutron Star Accretion Flows: a Self-similar Analysis",
        "description": "This paper investigates the accretion process of a magnetized neutron star surrounded by a super-Eddington accretion disk. By developing self-similar solutions, the study reveals the interaction between the NS magnetosphere and the disk, including the role of magnetic fields, NS rotation, and radiation. The model is applicable to various astrophysical systems, such as ultraluminous X-ray binaries and AGN disks.",
        "topic": "High Energy Astrophysical Phenomena",
        "source_type": "Preprint",
        "credibility": "High",
        "region": "International",
        "published_date": "2024-07-01",
        "created_at": "2025-05-11",
        "author": "Ken Chen, Zi-Gao Dai"
      },
      {
        "article_link": "https://doi.org/10.48550/arXiv.2407.00200",
        "title": "Formation of Wind-Fed Black Hole High-mass X-ray Binaries: The Role of Roche-lobe-Overflow Post Black-Hole Formation",
        "description": "This paper investigates the origin of high black hole spins in wind-fed high-mass X-ray binaries (BH-HMXBs). The authors conduct a binary population synthesis study, suggesting that Roche-lobe overflow after black hole formation is crucial for the observed high spin rates, and highly conservative accretion is required to explain these spins.",
        "topic": "High Energy Astrophysical Phenomena",
        "source_type": "Preprint",
        "credibility": "High",
        "region": "International",
        "published_date": "2024-07-01",
        "created_at": "2025-05-11",
        "author": "Zepei Xing, Tassos Fragos, Emmanouil Zapartas, Tom M. Kwan, Lixin Dai, Ilya Mandel, Matthias U. Kruckow, Max Briel, Jeff J. Andrews, Simone S. Bavera, Seth Gossage, Konstantinos Kovlakas, Kyle A. Rocha, Meng Sun, Philipp M. Srivastava"
      },                                   
      {
        "article_link": "https://doi.org/10.48550/arXiv.2407.00358",
        "title": "Minimizing the tensor-to-scalar ratio in single-field inflation models",
        "description": "This paper revisits a class of simple single-field inflation models, demonstrating that they can produce a negligible tensor-to-scalar ratio r. Using corrected versions of the quadratic hilltop potential motivated by effective field theory, the study employs Markov Chain Monte Carlo (MCMC) methods to minimize r values, achieving a minimum r of ~10^-11 while adhering to observable constraints.",
        "topic": "Cosmology and Nongalactic Astrophysics",
        "source_type": "Journal Article",
        "credibility": "High",
        "region": "Global",
        "published_date": "2024-12-18",
        "created_at": "2025-05-11",
        "author": "William J. Wolf"
      },
      {
        "article_link": "https://doi.org/10.48550/arXiv.2407.00384",
        "title": "A Markovian description of the multi-level source function and its application to the Lyman series in the Sun",
        "description": "This paper introduces a method to calculate indirect transition rates in atomic levels using Markov chain theory. It applies this to the Lyman series in the Sun, analyzing interlocking processes and the formation of spectral lines outside local thermodynamic equilibrium (LTE), showing how interlocking contributions increase with the order in the Lyman series.",
        "topic": "Solar and Stellar Astrophysics",
        "source_type": "Preprint",
        "credibility": "High",
        "region": "Global",
        "published_date": "2024-06-29",
        "created_at": "2025-05-11",
        "author": "Kilian Krikova, T. M. D. Pereira"
      },
      {
        "article_link": "https://doi.org/10.48550/arXiv.2407.00583",
        "title": "Closure invariants for polarised radio interferometric observations: a graph theoretical approach",
        "description": "This paper extends the formalism of closure invariants for radio interferometric observations to incomplete graphs. The method enables extraction of usable information from visibilities even in the presence of noise, providing a powerful tool for studying magnetic fields in synchrotron sources with full polarisation.",
        "topic": "Instrumentation and Methods for Astrophysics",
        "source_type": "Preprint",
        "credibility": "High",
        "region": "Global",
        "published_date": "2024-06-30",
        "created_at": "2025-05-11",
        "author": "Vinay Kumar, Rajaram Nityananda, Joseph Samuel"
      }
  ]
  